# templates_data.py
# 气象预警用语模板数据

WEATHER_TEMPLATES = {
    "雷电": {
        "黄色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷电黄色预警信号：预计未来6小时内我县将发生雷电天气，并可能伴有短时强降水或大风，请做好防范。",
            "继续发布预警用语": "平乐县气象台{day}日{hour}时{minute}分继续发布雷电黄色预警信号：预计未来6小时内我县将发生雷电天气，并可能伴有短时强降水或大风，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷电橙色预警信号：预计未来2小时内我县发生雷电活动的可能性很大，并可能伴有短时强降水或大风，请注意防范。",
            "继续发布预警用语": "平乐县气象台{day}日{hour}时{minute}分继续发布雷电橙色预警信号：预计未来2小时内我县发生雷电活动的可能性很大，并可能伴有短时强降水或大风，请注意防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷电橙色预警信号：我县已经出现雷电活动影响，且可能持续，并可能伴有短时强降水或大风，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷电红色预警信号：预计未来2小时内我县发生雷电活动的可能性非常大，并可能伴有短时强降水或大风，请做好防范。",
            "继续发布预警用语": "平乐县气象台{day}日{hour}时{minute}分继续发布雷电红色预警信号：预计未来2小时内我县发生雷电活动的可能性非常大，并可能伴有短时强降水或大风，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷电红色预警信号：我县已经出现强烈雷电活动，且可能持续，并可能伴有短时强降水或大风，请做好防范。"
        }
    },
    "雷雨大风": {
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风黄色预警信号：预计未来6小时内我县受雷雨大风影响,将出现7～8级阵风并伴有雷电,请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风黄色预警信号：我县已经受雷雨大风影响, 阵风达7～8级并伴有雷电，且可能持续, 请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风橙色预警信号：预计未来2小时内我县受雷雨大风影响,将出现9～11级阵风并伴有雷电,请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风橙色预警信号：我县已经受雷雨大风影响, 阵风达9～11级并伴有雷电，且可能持续, 请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风红色预警信号：预计未来2小时内我县受雷雨大风影响,将出现12级以上阵风并伴有雷电,请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布雷雨大风红色预警信号：我县已经受雷雨大风影响, 阵风达12级以上并伴有雷电，且可能持续, 请做好防范。"
        }
    },
    "大风": {
        "蓝色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风蓝色预警信号：预计未来24小时内我县将出现6级（或阵风7级）以上大风，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风蓝色预警信号：我县已出现6到7级（或阵风7到8级）以上大风，且大风持续，请做好防范。"
        },
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风黄色预警信号：预计未来12小时内我县将出现8级以上大风（或阵风9级以上），请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风黄色预警信号：我县已出现8级大风，阵风9级，且大风持续，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风橙色预警信号：预计未来6小时内我县将出现10级以上大风（或阵风11级以上大风），请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风橙色预警信号：我县已出现10级大风，阵风11级，且大风持续，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风红色预警信号：预计未来6小时内我县将出现12级以上大风（或阵风13级以上大风），请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大风红色预警信号：我县已出现12级大风，阵风13级，且大风持续，请做好防范。"
        }
    },
    "寒潮": {
        "蓝色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮蓝色预警信号：预计24小时内我县日平均气温将急剧下降8度以上，且日平均气温降至7度以下，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮蓝色预警信号：24小时内我县日平均气温已急剧下降XX度、日平均气温降至XX度，请做好防范。"
        },
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮黄色预警信号：预计24小时内我县日平均气温将急剧下降10度以上，且日平均气温降至5度以下，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮黄色预警信号：24小时内我县日平均气温已急剧下降XX度，日平均气温降至X度，易出现冻害，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮橙色预警信号：预计24小时内我县日平均气温将急剧下降12度以上，且日平均气温降至3度以下，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布寒潮橙色预警信号：24小时内我县日平均气温已急剧下降XX度，日平均气温降至X度，易出现冻害，请做好防范。"
        }
    },
    "高温": {
        "黄色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布高温黄色预警信号：预计未来三天我县日最高气温将在35℃以上，请做好防范。"
        },
        "橙色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布高温橙色预警信号：预计未来24小时内我县将出现37℃以上的高温天气，请做好防范。"
        },
        "红色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布高温红色预警信号：预计未来24小时内我县将出现40℃以上的高温天气，请做好防范。"
        }
    },
    "冰雹": {
        "橙色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布冰雹橙色预警信号：预计未来6小时内我县可能出现冰雹伴随雷电大风天气，并可能造成雹灾，请做好防范。"
        },
        "红色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布冰雹红色预警信号：预计未来2小时内我县出现冰雹可能性极大，并伴随雷电大风天气，可能造成雹灾，请防范。"
        }
    },
    "道路结冰": {
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰黄色预警信号：预计未来24小时内我县可能出现对交通有影响的道路结冰，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰黄色预警信号：我县XX已经出现对交通有影响的道路结冰，且未来24小时内仍然维持，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰橙色预警信号：预计未来12小时内我县可能出现对交通有较大影响的道路结冰，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰橙色预警信号：我县XX已经出现对交通有较大影响的道路结冰，且未来12小时内仍然维持，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰红色预警信号：预计未来6小时内我县可能出现对交通有很大影响的道路结冰，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布道路结冰红色预警信号：我县XX已经出现对交通有很大影响的道路结冰，且未来6小时内仍然维持，请做好防范。"
        }
    },
    "霜冻": {
        "蓝色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻蓝色预警信号：预计24小时内我县最低气温将下降到4度以下且可能出现霜冻，将对农业产生影响，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻蓝色预警信号：我县最低气温下降到4度且已经出现霜冻，将对农业产生影响，请做好防范。"
        },
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻黄色预警信号：预计24小时内我县最低气温将下降到2度以下且可能出现霜冻，将对农业产生影响，请防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻黄色预警信号：我县最低气温下降到2度且已经出现霜冻，将对农业产生较大影响，请防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻橙色预警信号：预计24小时内我县最低气温将下降到0度以下且可能出现霜冻，将对农业产生影响，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霜冻橙色预警信号：我县最低气温下降到零下0度并已经出现霜冻，将对农业产生严重影响，请做好防范。"
        }
    },
    "大雾": {
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾黄色预警信号：预计未来12小时内我县将出现能见度小于500米的大雾天气，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾黄色预警信号：我县已出现能见度为500米的浓雾，且大雾天气可能持续，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾橙色预警信号：预计未来6小时内我县将出现能见度小于200米的浓雾，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾橙色预警信号：我县已出现能见度为200米的浓雾，且大雾天气可能持续，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾红色预警信号：预计未来2小时内我县将出现能见度小于50米的强浓雾，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布大雾红色预警信号：我县已出现能见度为50米的浓雾，且大雾可能持续，请做好防范。"
        }
    },
    "干旱": {
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时发布干旱橙色预警信号：预计未来一周我县综合气象干旱指数达到重旱(气象干旱为25到50年一遇)，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时发布干旱橙色预警信号：过去XX（一段时间）以来，我县已经有40%以上的农作物受旱，且干旱持续，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时发布干旱红色预警信号：预计未来一周我县综合气象干旱指数达到特旱(气象干旱为50年一遇)，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时发布干旱红色预警信号：过去XX（一段时间）以来，我县已经有60%以上的农作物受旱，且干旱持续，请做好防范。"
        }
    },
    "台风": {
        "蓝色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风蓝色预警信号：受XX号台风影响，24小时内我县将出现6级以上、或阵风8级大风，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风蓝色预警信号：受XX号台风影响，我县已出现6级（或阵风8级）以上大风，24小时内大风将持续，请防范。"
        },
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风黄色预警信号：受XX号台风影响，24小时内我县将出现8级、或阵风10级以上大风，请防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风黄色预警信号：受XX号台风影响，我县已出现8级（或阵风10级）以上大风，24小时内大风将持续，请防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风橙色预警信号：受XX号台风影响，12小时内我县将出现10级、或阵风12级以上大风，请防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风橙色预警信号：受XX号台风影响，我县已出现10级（或阵风12级）以上大风，12小时内大风将持续，请防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风红色预警信号：受XX号台风影响，6小时内我县将出现12级、或阵风14级以上大风，请防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布台风红色预警信号：受XX号台风影响，我县已出现12级（或阵风14级）以上大风，6小时内大风将持续，请防范。"
        }
    },
    "暴雪": {
        "蓝色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪蓝色预警信号：预计未来12小时内我县降雪量将达4毫米以上，可能对交通或者农牧业有影响，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪蓝色预警信号：我县部分乡镇降雪量超过4毫米，预计未来12小时内降雪持续，请做好防范。"
        },
        "黄色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪黄色预警信号：预计未来12小时内我县降雪量将达6毫米以上，且降雪持续，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪黄色预警信号：我县部分乡镇降雪量超过6毫米，预计未来12小时内降雪持续，请做好防范。"
        },
        "橙色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪橙色预警信号：预计未来6小时内我县降雪量将达10毫米以上，且降雪持续，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪橙色预警信号：我县部分乡镇降雪量超过10毫米，预计未来6小时内降雪持续，请做好防范。"
        },
        "红色": {
            "提前预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪红色预警信号：预计未来6小时内我县降雪量将达15毫米以上，且降雪持续，请做好防范。",
            "过程预警用语": "平乐县气象台{day}日{hour}时{minute}分发布暴雪红色预警信号：我县部分乡镇降雪量超过15毫米， 预计未来6小时内降雪持续，请做好防范。"
        }
    },
    "霾": {
        "黄色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霾黄色预警信号：预计未来24小时内将出现中度霾，易形成中度空气污染。"
        },
        "橙色": {
            "预警用语": "平乐县气象台{day}日{hour}时{minute}分发布霾橙色预警信号：预计未来24小时内将出现重度霾，易形成重度空气污染。"
        }
    }
}
